PROJETO SO-2/DIAGRAMAS EM MERMAID/DOCUMENTAÇÃO DAS PASTAS  VISÃO MACRO  .mmd
graph LR
    C["C:/"] --> LOBODOMALTE["LOBODOMALTE"]
    C --> Dados["Dados"]
    C --> Wallpaper["Wallpaper"]

    LOBODOMALTE --> LOBODOMALTE_Perms["Administradores: Controle Total
Todos: ler & executar, listar conteúdo da pasta, leitura"]

    Dados --> Dados_Perms["Administradores: Controle Total
Usuários: ler & executar, listar conteúdo da pasta, leitura"]

    Wallpaper --> Wallpaper_Perms["Administradores: Controle Total
Sistema: Controle Total
Usuários: ler & executar, listar conteúdo da pasta, leitura
Proprietário Criador: Permissões especiais"]
